examples/rest-api/artillery/tests/csharp.yml
config:
    target: "https://e78xhr5pjb.execute-api.us-east-1.amazonaws.com/dev"
    phases:
        - duration: 1
          arrivalRate: 20
    processor: "./processor.js"
scenarios:
    - flow:
          - function: "provisionTestData"
          - post:
                url: "/product"
                json:
                    sku: "{{sku}}"
                    name: "{{name}}"
                    description: "{{description}}"
          - get:
                url: "/products"
          - put:
                url: "/product"
                json:
                    sku: "{{sku}}"
                    name: "{{name}}"
                    description: "{{description}}"
          - get:
                url: "/product/{{sku}}"
          - delete:
                url: "/product/{{sku}}"
                json:
                    sku: "{{sku}}"
                    name: "{{newName}}"
                    description: "{{newDescription}}"